#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_acm_certificate.certificate: Refreshing state... [id=arn:aws:acm:us-east-1:439793709230:certificate/c4e92cdb-24c0-441c-94db-b3f4abbed378]
aws_cloudfront_origin_access_control.default: Refreshing state... [id=EV1HZVTQ1U0BW]
aws_s3_bucket.s3-bucket: Refreshing state... [id=caitlingbailey.com]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
data.aws_route53_zone.zone: Reading...
data.aws_route53_zone.zone: Read complete after 1s [id=Z05129602064YT69ODB82]
aws_s3_bucket_public_access_block.website_bucket_access: Refreshing state... [id=caitlingbailey.com]
aws_s3_bucket_website_configuration.website-bucket-config: Refreshing state... [id=caitlingbailey.com]
aws_s3_bucket_versioning.website-bucket-versioning: Refreshing state... [id=caitlingbailey.com]
aws_cloudfront_distribution.cdn_static_website: Refreshing state... [id=E2ZTE2KW0H2XW9]
aws_s3_bucket_policy.website-bucket-policy: Refreshing state... [id=caitlingbailey.com]
aws_route53_record.www: Refreshing state... [id=Z05129602064YT69ODB82_www.caitlingbailey.com_A]
aws_route53_record.apex: Refreshing state... [id=Z05129602064YT69ODB82_caitlingbailey.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_origin_access_control.website_origin_access_control will be created
  + resource "aws_cloudfront_origin_access_control" "website_origin_access_control" {
      + arn                               = (known after apply)
      + description                       = "Cloudfront access control policy for the caitlingbailey.com distribution."
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "caitlingbailey.com Access Control Policy"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>